# Homebrew manifest for macOS machines bootstrapped by this repo.
# Keep this list public and curated from the current Mac inventory.

tap "jandedobbeleer/oh-my-posh"

brew "act"
brew "actionlint"
brew "ast-grep"
brew "bat"
brew "biome"
brew "colordiff"
brew "difftastic"
brew "dockutil"
brew "eza"
brew "exiftool"
brew "exiv2"
brew "imagemagick"
brew "ffmpeg"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "htop"
brew "jq"
brew "mole"
brew "mongosh"
brew "mas"
brew "nano"
brew "oh-my-posh"
brew "pandoc"
brew "openjdk@21"
brew "pre-commit"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "swift-format"
brew "swiftly"
brew "tmux"
brew "trash"
brew "tree"
brew "xmlstarlet"
brew "uv"
brew "yq"
brew "zoxide"

cask "android-platform-tools"
cask "aya"
cask "beekeeper-studio"
cask "bruno"
cask "chatgpt"
cask "chatgpt-atlas"
cask "codex-app"
cask "codexbar"
cask "cursor"
cask "dbeaver-community"
cask "devtoys"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "github"
cask "google-chrome"
cask "iina"
cask "jetbrains-toolbox"
cask "maccy"
cask "keka"
cask "keyguard"
cask "latest"
cask "meld"
cask "mongodb-compass"
cask "onyx"
cask "orbstack"
cask "opencode-desktop"
cask "proxyman"
cask "postman"
cask "requestly"
cask "repobar"
cask "scroll-reverser"
cask "spotify"
cask "raycast"
cask "sublime-merge"
cask "tailscale-app"
cask "rustdesk"
cask "stats"
cask "trimmy"
cask "upscayl"
cask "wailbrew"
cask "visual-studio-code"
cask "warp"
cask "wave"
cask "zen"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Folder Quick Look", id: 6753110395
mas "LocalSend", id: 1661733229
mas "Xcode", id: 497799835

# Add Mac App Store entries here later with mas once you want to manage them centrally.
