# Homebrew manifest for macOS machines bootstrapped by this repo.
# Keep this list generic and public; personal apps can be installed manually.

tap "homebrew/cask-fonts"
tap "jandedobbeleer/oh-my-posh"

brew "act"
brew "actionlint"
brew "ast-grep"
brew "bat"
brew "biome"
brew "difftastic"
brew "dockutil"
brew "eza"
brew "exiftool"
brew "exiv2"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "htop"
brew "jq"
brew "mas"
brew "nano"
brew "oh-my-posh"
brew "pandoc"
brew "pre-commit"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "swift-format"
brew "swiftly"
brew "tmux"
brew "trash"
brew "tree"
brew "uv"
brew "yq"
brew "zoxide"

cask "bruno"
cask "cursor"
cask "dbeaver-community"
cask "github"
cask "maccy"
cask "ngrok"
cask "orbstack"
cask "postman"
cask "raycast"
cask "rustdesk"
cask "stats"
cask "font-hack-nerd-font"

# Add Mac App Store entries here later with mas once you want to manage them centrally.
